Repository: grenmap/GREN-Map-DB-Node
Catalog: django/grenml_import/locale/*/LC_MESSAGES/django.po
Languages: fr

source: File size must not exceed 20 MB
fr: Le fichier ne doit pas dépasser 20 Mo.

source: Please provide a topology name while importing.
fr: Veuiller donner un nom à la topologie pendant son importation.

source: Please upload .xlsx or .xml extension files only
fr: Veuiller ne télécharger que des fichiers à extension .xlsx ou .xml.

source: (Empty! GRENML data may have been purged to save database space.)
fr: (Vide! Il se peut que les données de GRENML ait été supprimées pour libérer de l'espace.)

source: Network Topology Import
fr: Importation de la topologie du réseau

source: Circular parent reference detected and avoided.
fr: Référence en boucle repérée et évitée

source: Imported at
fr: Importé à

source: import status
fr: état de l'importation

source: import message
fr: message concernant l'importation

source: The imported file's root Topology will be added as a child of the selected Topology. To add a file's contents as a top-level Topology, select the blank entry here.
fr: La Topologie racine du fichier importé sera ajoutée à la descendance de la Topologie sélectionnée. Pour que le contenu du fichier soit enregistré comme une Topologie du niveau supérieur, sélectionner l'inscription en blanc que voici.

source: Parent topology
fr: Topologie mère

source: Import state
fr: État de l'importation

source: GRENML data
fr: Données GRENML

source: No GRENML data to import.
fr: Aucune donnée GRENML à importer

source: {import_data_verbose_name} from {source} at {timestamp}
fr: {import_data_verbose_name} de {source} à {timestamp}

source: GRENML Data Import
fr: Importation de données GRENML

source: GRENML Data Imports
fr: Importations de données GRENML

source: File
fr: Fichier

source: Name
fr: Nom

source: Equal to the client name associated to the access token in the import request. Imports done through the admin interface will use the null value.
fr: Correspond au nom du client associé au jeton d'accès dans la demande d'importation. Les importations effectuées à partir de l'interface Admin utiliseront la valeur nulle.

source: Token client name
fr: nom de client du Jeton

source: We can import files using the admin interface or the API endpoint.
fr: Les fichiers peuvent être importés à partir de l'interface Admin ou du point terminal de l'API.

source: New name for the imported topology. Required for Excel .xlsx files. Not applicable for .grenml or .xml files.
fr: Nouveau nom pour la topologie importée. Nécessaire pour les fichiers .xlsx d'Excel. Ne s'applique pas aux fichiers .grenml ou .xml.

source: Topology name
fr: Nom de la topologie

source: GRENML File Import
fr: Importation de fichiers GRENML

source: GRENML File Imports
fr: Importations de fichiers GRENML

source: Topology name is not applicable to GRENML/XML files.
fr: Ce nom de topologie ne peut s'appliquer aux fichiers GRENML/XML.

source: Topology name is required for Excel files.
fr: Les fichiers Excel doivent avoir un nom de topologie.

source: Error importing XML file.
fr: Erreur lors de l'importation du fichier XML.

source: Error importing Excel file.
fr: Erreur lors de l'importation du fichier Excel.

source: Unsupported file. Supported types: .grenml, .xml, .xlsx
fr: Fichier non accepté. Fichiers acceptés : .grenml, .xml, .xlsx

source: Status: {}
fr: État : {}

source: Topologies: {} parsed, {} imported
fr: Topologies : {} analysées, {} importées

source: WARNING:
fr: ATTENTION :

source: Institutions: {} parsed, {} imported
fr: Institutions : {} analysées, {} importées

source: Nodes: {} parsed, {} imported
fr: Nœuds : {} analysés, {} importés

source: Links: {} parsed, {} imported
fr: Liens : {} analysés, {} importés

source: ERRORS:
fr: ERREURS :

source: Use this endpoint to upload a GRENML file. <br> <br>
fr: Utiliser ce point terminal pour télécharger un fichier GRENML
