Repository: grenmap/GREN-Map-DB-Node
Catalog: django/fim/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Federated Identity Management
fr: Gestion fédérée des identités

source: User
fr: Utilisateur

source: eduPerson Principal Name
fr: Nom principal de l'eduPerson

source: A R&S Identity with that eppn already exists.
fr: L'eppn a déjà une identité R&S.

source: email
fr: courriel

source: Display Name
fr: Nom affiché

source: First Name
fr: Prénom

source: Last Name
fr: Nom

source: RS Identity
fr: Identité RS

source: RS Identities
fr: Identités RS

source: Something has gone wrong with your FIM identity. Please contact the site administrator for further assistance.
fr: Votre identité GFI pose un problème. Veuillez communiquer avec l'administrateur du site pour obtenir de l'aide.

source: Welcome %(first_name)s %(last_name)s. You are now logged in.
fr: Bienvenue %(first_name)s %(last_name)s. Vous êtes connecté.

source: You are logged out. Your identity credentials may still be stored in your browser; if you are using a public computer, please fully exit your browser to completely log out.
fr: La séance est terminée. Il se peut que vos identifiants soient toujours enregistrés dans le navigateur. Si vous utilisez un ordinateur public, fermez le navigateur pour mettre fin complètement à la séance.
