Repository: grenmap/GREN-Map-DB-Node
Catalog: django/visualization/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Value must be 'True' or 'False'
fr: La valeur doit être 'True' (vrai) ou 'False' (faux).

source: Please enter latitude and longitude between parentheses: (latitude, longitude).
fr: Veuillez inscrire la latitude et la longitude entre parenthèses : (latitude, longitude).

source: The valid range for latitude is from -90 (South Pole) to 90 (North Pole).
fr: La plage pour la latitude doit être de -90 (pôle sud) à 90 (pôle nord).

source: The valid range for longitude is from -180 to 180.
fr: La plage pour la longitude doit être de -180 à 180.

source: The zoom setting must be a positive number
fr: La valeur du grossissement doit être positive.

source: GREN Map Visualization
fr: Visualisation de la carte du RMRE

source: Build Redis Cache For Visualization
fr: Créer l'antémémoire Redis pour la visualisation

source: An easy to remember name for this hostname. i.e. The organization this is for.
fr: Un nom facile à retenir pour cet hôte, par exemple celui de l'organisation concernée.

source: origin
fr: origine

source: Visualization Allowed Origin
fr: Origine autorisée de la visualisation

source: Visualization Map Allowed Origins
fr: Origines autorisées de la carte de visualisation

source: Visualization is disabled
fr: La visualisation a été désactivée.
