Repository: grenmap/GREN-Map-DB-Node
Catalog: django/collation/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Permanently deletes matched Institutions. Removes these Institutions as owners of Nodes and Links.
fr: Supprime de façon permanente les Institutions correspondantes. Retranche ces Institutions en tant que propriétaires des Nœuds et des Liens.

source: Delete Institution
fr: Supprimer l'Institution

source: Permanently deletes matched Links.
fr: Supprime de façon permanente les Liens correspondants.

source: Delete Link
fr: Supprimer le Lien

source: Permanently deletes matched Nodes and their attached Links.
fr: Supprime de façon permanente les Nœuds correspondants et leurs Liens.

source: Delete Node
fr: Supprimer le Nœud

source: Replaces all matched Institutions with the Institution added to the DB most recently (inferred by autoincrement primary key). Ownership of Nodes and Links and Topologies by all deleted Institutions will be transferred to the remaining Institution. The kept Institution will NOT belong to the union of all Topologies from discarded Institutions; this can be altered with the UNION_TOPOLOGIES class constant.
fr: Remplace les Institutions associées à la dernière institution ajoutée à la BD (déduite d'après la clé principale d'incrémentation automatique). La Propriété des Nœuds et des Liens ainsi que la Topologie des Institutions supprimées seront transférées à l'Institution restante. L'Institution conservée ne figurera PAS dans la Topologie des Institutions supprimées. Ceci pourra être modifié avec la constante de classe UNION_TOPOLOGIES.

source: Keep Newest Institution
fr: Garder l'Institution la plus récente

source: Replaces all matched Links with the Link added to the DB most recently (inferred by autoincrement primary key). The kept Link will NOT belong to the union of all Topologies from discarded Links; this can be altered with the UNION_TOPOLOGIES class constant.
fr: Remplace les Liens associés au dernier lien ajouté à la BD (déduit d'après la clé principale d'incrémentation automatique). Le Lien conservé ne figurera PAS dans la Topologie des Liens supprimés. Ceci peut être modifié avec la constante de classe UNION_TOPOLOGIES.

source: Keep Newest Link
fr: Garder le Lien le plus récent

source: Replaces all matched Nodes with the Node added to the DB most recently (inferred by autoincrement primary key). Link endpoints represented by all deleted Nodes will be updated to refer to the remaining Node. The kept Node will NOT belong to the union of all Topologies from discarded Institutions; this can be altered with the UNION_TOPOLOGIES class constant.
fr: Remplace les Nœuds associés au dernier Nœud ajouté à la BD (déduit par la clé principale d'incrémentation automatique). Le point terminal des Liens des Nœuds supprimés sera actualisé de façon à renvoyer au Nœud restant. Le Nœud restant ne figurera PAS dans la Topologie des Institutions supprimées. Ceci pourra être modifié avec la constante de classe UNION_TOPOLOGIES.

source: Keep Newest Node
fr: Garder le Nœud le plus récent

source: Merges the matched Institution (A) into the Institution specified by ID on the Action (B). A merge target Institution may be further identified by Topology. Fields in A will be transferred to B if they don't already exist in B. All properties of and tag on A will be added to B. Ownership of Nodes and Link by A will be transferred to B. B will inherit all Topology memberships from A. A will be permanently deleted.
fr: Combine l'Institution (A) indiquée à l'Institution identifiée dans l'Action (B). L'Institution de destination qui a été combinée pourra être précisée davantage avec la Topologie. Les champs de A seront transférés à B, s'ils ne s'y trouvent pas déjà. Les propriétés et les balises de A seront ajoutées à B. La propriété des Noeuds et du Lien de A sera transférée à B. B héritera tous les éléments de la Topologie de A. A sera supprimé de façon permanente.

source: Merge into Institution
fr: Combiner à l'Institution

source: Merges the matched Link (A) into the Link specified by ID on the Action (B). A merge target Link may be further identified by Topology. Fields in A will be transferred to B if they don't already exist in B. All properties of and tag on A will be added to B. B will inherit all Topology memberships from A. A will be permanently deleted.
fr: Combine le Lien (A) indiqué à celui identifié dans l'Action (B). Le Lien de destination qui a été combiné pourra être précisé davantage avec la Topologie. Les champs de A seront transférés à B, s'ils ne s'y trouvent pas déjà. Les propriétés et la balise de A seront ajoutées à B. B héritera tous les éléments de la Topologie de A. A sera supprimé de façon permanente.

source: Merge into Link
fr: Combiner au Lien

source: Merges the matched Node (A) into the Node specified by ID on the Action (B). A merge target Node may be further identified by Topology. Fields in A will be transferred to B if they don't already exist in B. All properties of and tag on A will be added to B. Link endpoints of A will be updated to B. B will inherit all Topology memberships from A. A will be permanently deleted.
fr: Combine le Nœud (A) indiqué à celui identifié dans l'Action (B). Le Nœud de destination qui a été combiné pourra être précisé davantage avec la Topologie. Les champs de A seront transférés à B s'ils ne s'y trouvent pas déjà. Les propriétés et la balise de A seront ajoutées à B. B héritera tous les éléments de la Topologie de A. A sera supprimé de façon permanente.

source: Merge into Node
fr: Combiner au Nœud

source: Replaces the matched Institution (A) with the Institution specified by ID on the Action (B). A replacement Institution may be further identified by Topology. Ownership of Nodes and Links by A will be transferred to B. A, and all of A's fields, properties, and tag, will be permanently deleted. The target Institution will inherit Topology membership from the discarded Institution.
fr: Remplace l'Institution (A) indiquée par celle identifiée dans l'Action (B). L'Institution de remplacement pourra être précisée davantage avec la Topologie. La propriété des Nœuds et les Liens de A seront transférés à B. A sera supprimé de façon permanente avec ses champs, propriétés et balises. L'Institution de destination héritera les éléments de la Topologie de l'Institution supprimée.

source: Replace with Institution
fr: Remplacer par l'Institution

source: Replaces the matched Link (A) with the Link specified by ID on the Action (B). A replacement Link may be further identified by Topology. A, and all of A's fields, properties, and tag, will be permanently deleted. B inherits A's Topology memberships.
fr: Remplace le Lien (A) indiqué par celui identifié dans l'Action (B). Le Lien de remplacement pourra être précisé davantage avec la Topologie. A sera supprimé de façon permanente avec ses champs, propriétés et balises. B héritera tous les éléments de la Topologie de A.

source: Replace with Link
fr: Remplacer par le Lien

source: Replaces the matched Node (A) with the Node specified by ID on the Action (B). A replacement Node may be further identified by Topology. Link endpoints of A will be updated to B. A, and all of A's fields, properties, and tag, will be permanently deleted.
fr: Remplace le Nœud (A) indiqué par identifié dans l'Action (B). Le Nœud de remplacement pourra être précisé davantage avec la Topologie. Le point terminal des Liens de A sera actualisé dans B. A sera supprimé de façon permanente avec ses champs, propriétés et balises.

source: Replace with Node
fr: Remplacer par le Nœud

source: match description
fr: description de la correspondance

source: Once a match type has been selected and this Rule is saved, a description of the match and its required fields will appear here.
fr: La description et les champs de l'élément choisi apparaîtront ici, une fois que le choix aura été effectué et que la Règle aura été sauvegardée.

source: required match info keys
fr: clés d'information requises pour la correspondance

source: optional match info keys
fr: clés d'information facultatives pour la correspondance

source: action description
fr: description de l'action

source: Once an action type has been selected and this Rule is saved, a description of the action and its required fields will appear here.
fr: La description et les champs de l'action choisie apparaîtront ici, une fois que le choix aura été effectué et que la Règle aura été sauvegardée.

source: required action info keys
fr: clés d'information requises pour l'action

source: optional action info keys
fr: clés d'information facultatives pour l'action

source: health check
fr: vérification de l'état

source: Rule misconfiguration detected
fr: Mauvaise configuration de la Règle détectée

source: Ready
fr: Prêt

source: Failed to export rulesets.
fr: L'exportation des jeux de règles a échoué.

source: health warning
fr: avertissement concernant l'état

source: rule actions
fr: actions de la règle

source: Apply Rule
fr: Appliquer la Règle

source: Clone Rule
fr: Cloner la Règle

source: Cloned rule {} successfully
fr: Règle {} clonée avec succès

source: Failed to clone rule {}
fr: La Règle {} n'a pu être clonée.

source: Data Collation
fr: Collationnement des données

source: Institution
fr: Institutions

source: Node
fr: Nœud

source: Link
fr: Lien

source: MatchCriteria and Actions with different element types
fr: Le type d'élément des critères de correspondance (MatchCriteria) et des Actions n'est pas le même.

source: Rule {} has MatchCriteria and Actions with different element_types
fr: Le type d'élément des critères de correspondance (MatchCriteria) et des Actions de la Règle {} n'est pas le même.

source: Incompatible Match Info for Rule {}
fr: Information de correspondance incompatible pour la Règle {}

source: Incompatible Action Info for Rule {}
fr: Information d'action incompatible pour la Règle {}

source: This Rule's {} Match Criterion must include exactly one Match Info for each of these keys: {}
fr: Le critère de correspondance (Match Criterion) de la Règle {} ne doit inclure qu'une seule information de correspondance pour chacune des clés que voici : {}

source: This Rule's {} Action must include exactly one Action Info for each of these keys: {}
fr: L'Action de la Règle {} ne doit inclure qu'un seule information d'action pour chacune des clés que voici : {}

source: No MatchCriteria associated to Rule {}.
fr: Aucun Critère de correspondance (MatchCriteria) associé à la Règle []

source: No Actions associated to Rule {}.
fr: Aucune Action associée à la Règle {}

source: MatchCriterion {} has unsupported MatchType with name "{}"
fr: Aucun Élément de correspondance appelé "{}" pour le Critère de correspondance (MatchCriterion) {}

source: Action {} has unsupported ActionType with name "{}"
fr: Aucun Type d'action appelé "{}" pour l'Action {}

source: Filters input elements to just the Institutions with a specified GRENML ID.
fr: Ne filtre les éléments entrant que pour les Institutions dont l'ID GRENML a été spécifié.

source: Match Institutions by ID
fr: Apparier les Institutions d'après leur ID

source: Filters input elements to just the Nodes with a specified GRENML ID.
fr: Ne filtre les éléments entrant que pour les Nœuds dont l'ID GRENML a été spécifié.

source: Match Nodes by ID
fr: Apparier les Nœuds d'après leur ID

source: Filters input elements to just the Links with a specified GRENML ID.
fr: Ne filtre les éléments entrant que pour les Liens dont l'ID GRENML a été spécifié.

source: Match Links by ID
fr: Apparier les Liens d'après leur ID

source: Filters input elements to just the Institutions within a specified Topology (by its ID). Often likely combined with other MatchType filters in Rules.
fr: Ne filtre les éléments entrant que pour les Institutions de la Topologie spécifiée (par son ID). Souvent combiné à d'autres filtres pour le Type de concordance (MatchType) dans les Règles.

source: Match Institutions by Topology
fr: Apparier les Institutions d'après leur Topologie

source: Filters input elements to just the Nodes within a specified Topology (by its ID). Often likely combined with other MatchType filters in Rules.
fr: Ne filtre les éléments entrant que pour les Nœuds de la Topologie spécifiée (par son ID). Souvent combiné à d'autres filtres pour le Type de concordance (MatchType) dans les Règles.

source: Match Nodes by Topology
fr: Apparier les Nœuds d'après leur Topologie

source: Filters input elements to just the Links within a specified Topology (by its ID). Often likely combined with other MatchType filters in Rules.
fr: Ne filtre les éléments entrant que pour les Liens de la Topologie spécifiée (par son ID). Souvent combiné à d'autres filtres pour le Type de concordance (MatchType) dans les Règles.

source: Match Links by Topology
fr: Apparier les Liens d'après leur Topologie

source: Rule {} Match by ID expects exactly one MatchInfo
fr: L'appariement de la Règle {} d'après son ID ne devrait reposer que sur une Information de concordance (MatchInfo).

source: Rule {} Match by ID expects MatchInfo with key 'ID'
fr: L'appariement de la Règle {} d'après son ID devrait reposer sur une Information de concordance (MatchInfo) avec un 'ID' majeur.

source: Filters input elements to just the Institution with a specified ID.
fr: Ne filtre les éléments entrant que pour l'Institution dont l'ID a été spécifié

source: Match Duplicate Institutions
fr: Apparier les Institutions identiques

source: Filters input elements to just the Node with a specified ID.
fr: Ne filtre les éléments entrant que pour le Nœud dont l'ID a été spécifié

source: Match Duplicate Nodes
fr: Apparier les Nœuds identiques

source: Filters input elements to just the Link with a specified ID.
fr: Ne filtre les éléments entrant que pour le Lien dont l'ID a été spécifié

source: Match Duplicate Links
fr: Apparier les Liens identiques

source: name
fr: nom

source: enabled
fr: activé

source: Rulesets are run in ascending order of priority. Ties are broken arbitrarily.
fr: Les Jeux de Règles sont exécutés de la priorité la plus faible à la plus haute. Les liens sont rompus de façon arbitraire.

source: priority
fr: priorité

source: Ruleset
fr: Jeu de Règles

source: Rulesets
fr: Jeux de Règles

source: ruleset
fr: Jeu de Règles

source: Rules within a Ruleset are run in ascending order of priority. Ties are broken arbitrarily.
fr: Les Règles d'un Jeu de Règles sont exécutées de la priorité la plus faible à la plus haute. Les liens sont rompus de façon arbitraire.

source: Rule
fr: Règle

source: Rules
fr: Règles

source: class name
fr: nom de la classe

source: element type
fr: type d'élément

source: JSON array of required ActionInfo keys
fr: Réseau JSON des clés ActionInfo (information d'action) requises

source: required info
fr: information requise

source: JSON array of optional ActionInfo keys
fr: Réseau JSON des clés ActionInfo(information d'action) facultatives

source: optional info
fr: information facultative

source: Match Type
fr: Type de correspondance

source: Match Types
fr: Types de correspondance

source: rule
fr: règle

source: match type
fr: type de correspondance

source: Match Criterion
fr: Critère de correspondance

source: Match Criteria
fr: critères de correspondance

source: match criterion
fr: critère de correspondance

source: key
fr: clé

source: value
fr: valeur

source: Match Info
fr: Information de correspondance

source: Match Infos
fr: Informations de correspondance

source: Action Type
fr: Type d'Action

source: Action Types
fr: Types d'Action

source: action type
fr: type d'action

source: Action Info
fr: Information d'action

source: Action Infos
fr: Informations d'action

source: Applied Rule {} successfully.
fr: Règle {} appliquée avec succès

source: Elements affected: {} Link(s), {} Node(s), {} Institution(s).
fr: Éléments touchés : {} Lien(s), {} Nœud(s), {} Institution(s)

source: Home
fr: Accueil

source: Please correct the error below.
fr: Veuillez corriger l'erreur ci-dessous.

source: Please correct the errors below.
fr: Veuillez corriger les erreurs ci-dessous.

source: Filter
fr: Filtre

source: Import rulesets
fr: Importer les jeux de règles

source: Done
fr: Terminé

source: Delete
fr: Supprimer

source: Save as new
fr: Enregistrer comme un nouveau fichier

source: Save and add another
fr: Enregistrer et en ajouter un autre

source: Save and continue editing
fr: Enregistrer et continuer les modifications

source: Save and view
fr: Enregistrer et visualiser

source: Close
fr: Fermer

source: Imported {} Ruleset(s) successfully. Discarded {} invalid ruleset(s).
fr: {} jeu(x) de règles importé(s) avec succès. {} jeu(x) de règles invalide(s) supprimé(s).

source: Import failed. Malformed file
fr: Échec de l'importation. Fichier défectueux.
