Repository: grenmap/GREN-Map-DB-Node
Catalog: django/*_app/locale/*/LC_MESSAGES/django.po
Languages: fr

source: The setting has been reset to its default value successfully
fr: La configuration a été réinitialisée avec succès.

source: Base App
fr: Appli de base

source: Requires a "polling" token. <br>Navigate to Home > Base App > Tokens in the admin site to obtain one.
fr: Nécessite un jeton "interrogation". <br>Allez à Accueil > Appli de base > Jetons sur le site Admin pour en obtenir un.

source: Requires an "import" token. <br>Navigate to Home > Base App > Tokens in the admin site to obtain one.
fr: Nécessite un jeton "importation". <br>Allez à Accueil > Appli de base > Jetons sur le site Admin pour en obtenir un.

source: To create a snapshot, open the admin site and navigate to Home > Published Network Data. <br> <br>
fr: Pour créer un instantané, ouvrez le site "Admin" et allez à Accueil > Appli de base > Jetons puis obtenez un jeton.

source: Creates default values for custom app defined settings and cleans unused settings
fr: Donne une valeur par défaut aux paramètres de l'appli spéciale et efface les paramètres inutilisés

source: name
fr: nom

source: display name
fr: nom à afficher

source: value
fr: valeur

source: App Configuration Setting
fr: Paramètre de configuration de l'appli

source: App Configuration Settings
fr: Paramètres de configuration de l'appli

source: This identifies the client which will be using this token.
fr: Identifie le client qui utilisera ce jeton

source: client name
fr: nom du client

source: The access token, a random string. Use the regenerate button to populate this field in case it is empty. Send it to the peer's administrator to have this node accept the peer's requests.
fr: Jeton d'accès, une chaîne aléatoire. Utilisez le bouton "rafraîchir" (regenerate) pour remplir le champ, s'il est vide. Envoyez le jeton à l'autre administrateur pour que le nœud accepte ses demandes.

source: Token
fr: Jeton

source: token type
fr: type de jeton

source: Tokens
fr: Jetons

source: ID of an existing topology.
fr: ID d'une topologie existante

source: Name to be given to the file's root topology once the server imports it.
fr: Nom à attribuer à la topologie racine du fichier après son importation par le serveur

source: Source server does not have a root topology.
fr: Le serveur d'origine n'a pas de topologie racine.

source: Root topology in source server does not have an owner. On the source server, go to Home › Network Topology › Network Topologies, then click on the root topology to see an edit page. Click on the plus button in the "Owner" row to add an owner institution.
fr: La topologie racine du serveur d'origine n'a pas de propriétaire. Sur le serveur d'origine, allez à Accueil > Topologie du réseau > Topologie des réseaux, puis cliquez la topologie du réseau pour que s'affiche la page "Modifier" (edit). Cliquez le bouton "plus" dans la rangée "Propriétaire" (Owner) pour ajouter l'institution propriétaire du réseau.

source: Topology in source server does not have an owner.
fr: Le serveur d'origine n'a pas de topologie racine.

source: Internal server error.
fr: Erreur du serveur interne

source: Import
fr: Importer

source: Polling
fr: Interrogation de GRENML

source: French
fr: Français

source: English
fr: Anglais

source: Spanish
fr: Espagnol

source: Portuguese
fr: Portugais

source: Change password
fr: Modifier le mot de passe

source: Log out
fr: Fermer la séance

source: View map
fr: Voir la carte

source: API docs
fr: Documentation sur les API

source: build:
fr: construit :

source: build information
fr: information sur le construit

source: build date
fr: date du construit

source: GRENMap DB Node commit hash
fr: empreinte de commit du nœud de la BD GRENMap

source: GRENMap DB Node git tag
fr: balise git du nœud de la BD GRENMap

source: GRENML library
fr: bibliothèque GRENMap

source: GRENMap visualization
fr: visualisation de GRENMap

source: Close
fr: Fermer

source: Login
fr: Ouvrir une séance

source: Map administration
fr: Administration de la carte

source: Save
fr: Enregistrer

source: Reset to default value
fr: Rétablir les valeurs par défaut
