Repository: grenmap/GREN-Map-DB-Node
Catalog: django/polling/locale/*/LC_MESSAGES/django.po
Languages: fr

source: {} was successfully pinged
fr: {} a été sondé avec succès.

source: Was able to connect to {} but got status code {}.
fr: La connexion avec {} a été établie, mais un code d'état {} a été obtenu en retour.

source: Was unable to connect to {}. Please review your configuration.
fr: La connexion avec {} n’a pu être établie. Veuillez vérifier la configuration.

source: Contacted {} source(s). Got {} successful response(s).
fr: {} source(s) a (ont) été contactée(s). {} réponse(s) obtenue(s).

source: Got {} error(s). Please check the configuration on source(s): {}
fr: {} erreur(s) reçue(s). Vérifiez la configuration de la (des) source(s) : {},

source: Collect GRENML Data
fr: Obtenir les données GRENML

source: Test Connection
fr: Vérifier la connexion

source: Polling Source Actions
fr: Actions de la source d'interrogation

source: Batch poll initiated; imports in progress.
fr: Interrogation en lot lancée; importations en cours.

source: Check the Status of Selected Sources
fr: Vérifier l'état des sources sélectionnées.

source: Poll the Selected Sources
fr: Interroger les sources sélectionnées

source: Poll and import initiated.
fr: Interrogation et importation lancées

source: Full batch poll and import for all active sources initiated.
fr: Interrogation du lot complet et importation des sources actives lancées

source: poll start
fr: début de l'interrogation

source: import start
fr: début de l'importation

source: GRENML data
fr: importation des données GRENML

source: number of sources
fr: nombre de sources

source: poll import status
fr: état de l'importation de l'interrogation

source: running duration (seconds)
fr: durée de l'exécution (secondes)

source: status synopsis
fr: résumé de l'état

source: Batch status: Complete
fr: État du lot : terminé

source: Batch status: Running
fr: État du lot : en cours

source: {} source total
fr: Total de la source {}

source: {} sources total
fr: Total des sources {}

source: ✅ Complete: {}
fr: ✅ terminé : {}

source: 🚧 In progress: {}
fr: 🚧 en cours : {}

source: 🕑 Pending: {}
fr: 🕑 en attente : {}

source: ❗️ Aborted due to error: {}
fr: ❗️ avorté à cause d'une erreur : {}

source: Schedule value must use croniter crontab format (See https://github.com/kiorky/croniter)
fr: La valeur prévue doit utiliser le format croniter crontab (voir https://github.com/kiorky/croniter).

source: Value must be 'True' or 'False' (Case sensitive)
fr: La valeur doit être 'True' (vrai) ou 'False' (faux). (Respecter la casse)

source: Value must be 'Live' or 'Published' (Case sensitive)
fr: La valeur doit être 'Live' (actif) ou 'Pubished' (affiché). (Respecter la casse)

source: GRENML Polling
fr: Interrogation de GRENML

source: Registers/updates the polling task
fr: Inscrit/actualise la tâche d'interrogation

source: was scheduled
fr: a été programmée

source: timestamp
fr: référence temporelle

source: duration seconds
fr: durée en secondes

source: status
fr: état

source: Poll and import batch at {}
fr: Interroger et importer le lot à {}

source: Poll+Import Event
fr: Activité Interrogation+Importation

source: Poll+Import Events
fr: Activités Interrogation+Importation

source: Aborted
fr: Avorté

source: Pending
fr: En attente

source: Polled; awaiting import
fr: Interrogation terminée; en attente de l'importation

source: Importing
fr: En importation

source: Complete
fr: Terminé

source: batch poll import
fr: importation d'interrogations en lot

source: polling source
fr: source de l'interrogation

source: status message
fr: message d'état

source: GRENML data import
fr: importation des données GRENML

source: poll duration seconds
fr: durée de l'interrogation en secondes

source: import duration seconds
fr: durée de l'importation en secondes

source: total time seconds
fr: durée totale en secondes

source: running time seconds
fr: durée d'exécution en secondes

source: poll
fr: interroger

source: Polling error:
fr: Erreur d'interrogation :

source: Import aborted:
fr: Importation avortée :

source: Poll and import from {} at {}
fr: Interroger et importer de {} à {}

source: An easy to remember name for this connection. i.e. The organization this is for.
fr: Un nom facile à retenir pour cette connexion, par exemple celui de l'organisation concernée

source: protocol
fr: protocole

source: host name
fr: nom de l'hôte

source: path
fr: chemin

source: The path to the GRENML DB node at this URL. Must end with a forward slash. (/)
fr: Chemin vers le nœud de la BD GRENML à cet URL. Doit se terminer par une barre oblique (/).

source: active
fr: actif

source: Access token provided by the peer node adminsitrator.
fr: Jeton d'accès fourni par l'administrateur du nœud apparié.

source: Token
fr: Jeton

source: status path
fr: chemin de l'état

source: polling path
fr: chemin de l'interrogation

source: Connection error {} with polling source [{}]
fr: Erreur de connexion {} avec la source de l'interrogation {}

source: Access denied. Token missing or invalid.
fr: Accès refusé. Jeton manquant ou invalide.

source: GRENML Polling Source
fr: Source d'interrogation GRENML

source: GRENML Polling Sources
fr: Sources d'interrogation GRENML

source: Collect All Active Sources' GRENML Data
fr: Recueillir toutes les données GRENML des sources actives

source: Check All Sources' Connection Statuses
fr: Vérifier l'état des connexions de toutes les sources

source: Polling is currently disabled
fr: Interrogation impossible pour l'instant

source: No active polling sources.
fr: Aucune source d'interrogation active
