Repository: grenmap/GREN-Map-DB-Node
Catalog: django/network_topology/locale/*/LC_MESSAGES/django.po
Languages: fr

source: GREN Administration Portal
fr: Portail de l'administration du RMRE

source: Applying Collation rules. Please note: this could result in this Element being modified post add or edit.
fr: Application des règles de collationnement. Attention : ceci pourrait entraîner la modification de l'Élément après qu'il a été ajouté ou modifié.

source: AutoIDForm does not have required GRENML_OBJECT_TYPE.
fr: AutoIDForm n'a pas le GRENML_OBJECT_TYPE requis.

source: The element ID provided already exists.
fr: L'ID fourni pour l'élément existe déjà.

source: There is a conflict with the auto-generated element ID. An object with the same name and short name may already exist.
fr: L'ID de l'élément créé automatiquement suscite un conflit. Peut-être existe-t-il déjà un objet portant le même nom ou nom abrégé.

source: is main
fr: est le (la) principal(e)

source: Mark one Topology as the main Topology for export.
fr: Indiquer la topologie qui deviendra la Topologie principale à exporter

source: Topology {} set as root for export and distributed database polling.
fr: La Topologie {} servira de racine pour l'exportation et l'interrogation de la base de données répartie.

source: Network Topology
fr: Topologie du réseau

source: More than one main Topology has been set. Cannot export. Select only one.
fr: Plusieurs Topologies principales établies. Exportation impossible. Veuillez n'en choisir qu'une.

source: GRENML ID
fr: ID GRENML

source: Supply a unique ID for this item.<br />Minimum: UUID or hash.<br />Good: ID consistent with your REN records, (beware publishing sensitive data).<br />Best: namespace-prefix the above somehow to avoid collisions.<br />Example: "myren-sunlighttransatlantic47"<br />Ideally co-ordinate with other RENs for common IDs of shared infrastructure.<br />If omitted, an ID will be auto-generated for this object.
fr: Attribuer un ID unique à l'élément. <br /> Strict minimum : UUID ou identifiant de hachage. <br /> Bien : ID cohérent avec les dossiers du RER (prenez garde à ne pas publier de données sensibles) <br /> Mieux : espacedenommage-préfixe quelconque pour éviter les collisions. <br /> Exemple : "monrer-sunlighttransatlantic47" <br /> Idéalement, se coordonner avec les autres RER pour choisir des ID qui auront la même infrastructure. <br />Si on omet cette opération, l'objet recevra un ID automatiquement.

source: Name
fr: Nom

source: dirty
fr: corrompu

source: This ID already exists in {}
fr: Cet ID existe déjà dans {}.

source: Will be converted to all lower case when saved
fr: Sera converti en minuscules à l'enregistrement

source: Value
fr: Valeur

source: property for
fr: propriété pour

source: Property
fr: Propriété

source: Properties
fr: Propriétés

source: WGS84 Latitude, in decimal degrees
fr: Latitude WGS84 en degrés décimaux

source: WGS84 Longitude, in decimal degrees
fr: Longitude WGS84 en degrés décimaux

source: The height of the location from sea level, in metres
fr: Élévation du lieu par rapport au niveau de la mer, en mètres

source: Address Line
fr: Ligne d'adresse

source: Location
fr: Emplacement

source: Locations
fr: Emplacements

source: start time and date
fr: début (date et heure)

source: end time and date
fr: fin (date et heure)

source: Lifetime
fr: Durée de vie

source: Lifetimes
fr: Durées de vie

source: Short Name
fr: Nom abrégé

source: Link Node A
fr: Nœud de liens A

source: Link Node B
fr: Nœud de liens B

source: The nodes of a link cannot be null
fr: Les nœuds d'un lien ne peuvent être nuls.

source: Invalid node configuration
fr: Configuration du nœud invalide

source: The nodes of a link cannot be the same
fr: Les nœuds d'un lien ne peuvent être identiques.

source: Network Link
fr: Lien du réseau

source: Network Links
fr: Liens du réseau

source: owners
fr: propriétaires

source: Network Element
fr: Élément du réseau

source: Network Elements
fr: Éléments du réseau

source: Network Node
fr: Nœud du réseau

source: Network Nodes
fr: Nœuds du réseau

source: owner
fr: propriétaire

source: The root Topology to use for GRENML exports and distributed DB polling. Only one Topology may be set as main.
fr: Topologie racine à utiliser pour les exportations GRENML et l'interrogation de la BD répartie. Il ne peut y avoir qu'une seule Topologie principale.

source: main
fr: principal(e)

source: Cannot create circular Topology reference
fr: Impossible de créer une référence en boucle pour la Topologie

source: Invalid Topology Configuration
fr: Configuration invalide de la Topologie

source: Topology tree contains circular Topology reference that caused a fatal error
fr: Une référence en boucle dans l'arborescence de la Topologie a engendré une erreur fatale.

source: Topology GRENML ID must be supplied and unique.
fr: Vous devez fournir un ID unique pour la Topologie GRENML.

source: Network Topologies
fr: Topologies du réseau
